Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_smartcard.h
/** @defgroup SMARTCARD_Word_Length SMARTCARD Word Length
  * @{
  */
#define SMARTCARD_WORDLENGTH_9B             USART_CR1_M0                    /*!< SMARTCARD frame length */
/**
  * @}
  */

/** @defgroup SMARTCARD_Stop_Bits SMARTCARD Number of Stop Bits
  * @{
  */
#define SMARTCARD_STOPBITS_0_5              USART_CR2_STOP_0                /*!< SMARTCARD frame with 0.5 stop bit  */
#define SMARTCARD_STOPBITS_1_5              USART_CR2_STOP                  /*!< SMARTCARD frame with 1.5 stop bits */
/**
  * @}
  */

/** @defgroup SMARTCARD_Parity SMARTCARD Parity
  * @{
  */
#define SMARTCARD_PARITY_EVEN               USART_CR1_PCE                   /*!< SMARTCARD frame even parity */
#define SMARTCARD_PARITY_ODD                (USART_CR1_PCE | USART_CR1_PS)  /*!< SMARTCARD frame odd parity  */
/**
  * @}
  */

/** @defgroup SMARTCARD_Mode SMARTCARD Transfer Mode
  * @{
  */
#define SMARTCARD_MODE_RX                   USART_CR1_RE                    /*!< SMARTCARD RX mode        */
#define SMARTCARD_MODE_TX                   USART_CR1_TE                    /*!< SMARTCARD TX mode        */
#define SMARTCARD_MODE_TX_RX                (USART_CR1_TE |USART_CR1_RE)    /*!< SMARTCARD RX and TX mode */
/**
  * @}
  */

/** @defgroup SMARTCARD_Clock_Polarity SMARTCARD Clock Polarity
  * @{
  */
#define SMARTCARD_POLARITY_LOW              0x00000000U                     /*!< SMARTCARD frame low polarity  */
#define SMARTCARD_POLARITY_HIGH             USART_CR2_CPOL                  /*!< SMARTCARD frame high polarity */
/**
  * @}
  */

/** @defgroup SMARTCARD_Clock_Phase SMARTCARD Clock Phase
  * @{
  */
#define SMARTCARD_PHASE_1EDGE               0x00000000U                     /*!< SMARTCARD frame phase on first clock transition  */
#define SMARTCARD_PHASE_2EDGE               USART_CR2_CPHA                  /*!< SMARTCARD frame phase on second clock transition */
/**
  * @}
  */

/** @defgroup SMARTCARD_Last_Bit SMARTCARD Last Bit
  * @{
  */
#define SMARTCARD_LASTBIT_DISABLE           0x00000000U                     /*!< SMARTCARD frame last data bit clock pulse not output to SCLK pin */
#define SMARTCARD_LASTBIT_ENABLE            USART_CR2_LBCL                  /*!< SMARTCARD frame last data bit clock pulse output to SCLK pin     */
/**
  * @}
  */

/** @defgroup SMARTCARD_NACK_Enable SMARTCARD NACK Enable
  * @{
  */
#define SMARTCARD_NACK_DISABLE              0x00000000U                     /*!< SMARTCARD NACK transmission disabled  */
#define SMARTCARD_NACK_ENABLE               USART_CR3_NACK                  /*!< SMARTCARD NACK transmission enabled */
/**
  * @}
  */

/** @defgroup SMARTCARD_Timeout_Enable SMARTCARD Timeout Enable
  * @{
  */
#define SMARTCARD_TIMEOUT_DISABLE           0x00000000U                     /*!< SMARTCARD receiver timeout disabled */
#define SMARTCARD_TIMEOUT_ENABLE            USART_CR2_RTOEN                 /*!< SMARTCARD receiver timeout enabled  */
/**
  * @}
  */

/** @defgroup SMARTCARD_ClockPrescaler  SMARTCARD Clock Prescaler
  * @{
  */
#define SMARTCARD_PRESCALER_DIV2    0x00000001U  /*!< SYSCLK divided by 2  */
#define SMARTCARD_PRESCALER_DIV4    0x00000002U  /*!< SYSCLK divided by 4  */
#define SMARTCARD_PRESCALER_DIV6    0x00000003U  /*!< SYSCLK divided by 6  */
#define SMARTCARD_PRESCALER_DIV8    0x00000004U  /*!< SYSCLK divided by 8  */
#define SMARTCARD_PRESCALER_DIV10   0x00000005U  /*!< SYSCLK divided by 10 */
#define SMARTCARD_PRESCALER_DIV12   0x00000006U  /*!< SYSCLK divided by 12 */
#define SMARTCARD_PRESCALER_DIV14   0x00000007U  /*!< SYSCLK divided by 14 */
#define SMARTCARD_PRESCALER_DIV16   0x00000008U  /*!< SYSCLK divided by 16 */
#define SMARTCARD_PRESCALER_DIV18   0x00000009U  /*!< SYSCLK divided by 10 */
#define SMARTCARD_PRESCALER_DIV20   0x0000000AU  /*!< SYSCLK divided by 20 */
#define SMARTCARD_PRESCALER_DIV22   0x0000000BU  /*!< SYSCLK divided by 22 */
#define SMARTCARD_PRESCALER_DIV24   0x0000000CU  /*!< SYSCLK divided by 24 */
#define SMARTCARD_PRESCALER_DIV26   0x0000000DU  /*!< SYSCLK divided by 26 */
#define SMARTCARD_PRESCALER_DIV28   0x0000000EU  /*!< SYSCLK divided by 28 */
#define SMARTCARD_PRESCALER_DIV30   0x0000000FU  /*!< SYSCLK divided by 30 */
#define SMARTCARD_PRESCALER_DIV32   0x00000010U  /*!< SYSCLK divided by 32 */
#define SMARTCARD_PRESCALER_DIV34   0x00000011U  /*!< SYSCLK divided by 34 */
#define SMARTCARD_PRESCALER_DIV36   0x00000012U  /*!< SYSCLK divided by 36 */
#define SMARTCARD_PRESCALER_DIV38   0x00000013U  /*!< SYSCLK divided by 38 */
#define SMARTCARD_PRESCALER_DIV40   0x00000014U  /*!< SYSCLK divided by 40 */
#define SMARTCARD_PRESCALER_DIV42   0x00000015U  /*!< SYSCLK divided by 42 */
#define SMARTCARD_PRESCALER_DIV44   0x00000016U  /*!< SYSCLK divided by 44 */
#define SMARTCARD_PRESCALER_DIV46   0x00000017U  /*!< SYSCLK divided by 46 */
#define SMARTCARD_PRESCALER_DIV48   0x00000018U  /*!< SYSCLK divided by 48 */
#define SMARTCARD_PRESCALER_DIV50   0x00000019U  /*!< SYSCLK divided by 50 */
#define SMARTCARD_PRESCALER_DIV52   0x0000001AU  /*!< SYSCLK divided by 52 */
#define SMARTCARD_PRESCALER_DIV54   0x0000001BU  /*!< SYSCLK divided by 54 */
#define SMARTCARD_PRESCALER_DIV56   0x0000001CU  /*!< SYSCLK divided by 56 */
#define SMARTCARD_PRESCALER_DIV58   0x0000001DU  /*!< SYSCLK divided by 58 */
#define SMARTCARD_PRESCALER_DIV60   0x0000001EU  /*!< SYSCLK divided by 60 */
#define SMARTCARD_PRESCALER_DIV62   0x0000001FU  /*!< SYSCLK divided by 62 */
/**
  * @}
  */

/** @defgroup SMARTCARD_Tx_Inv SMARTCARD advanced feature TX pin active level inversion
  * @{
  */
#define SMARTCARD_ADVFEATURE_TXINV_DISABLE  0x00000000U                  /*!< TX pin active level inversion disable */
#define SMARTCARD_ADVFEATURE_TXINV_ENABLE   USART_CR1_TX_INV              /*!< TX pin active level inversion enable  */
/**
  * @}
  */

/** @defgroup SMARTCARD_Rx_Inv SMARTCARD advanced feature RX pin active level inversion
  * @{
  */
#define SMARTCARD_ADVFEATURE_RXINV_DISABLE  0x00000000U                  /*!< RX pin active level inversion disable */
#define SMARTCARD_ADVFEATURE_RXINV_ENABLE   USART_CR1_RX_INV              /*!< RX pin active level inversion enable  */
/**
  * @}
  */

/** @defgroup SMARTCARD_Data_Inv SMARTCARD advanced feature Binary Data inversion
  * @{
  */
#define SMARTCARD_ADVFEATURE_DATAINV_DISABLE  0x00000000U                /*!< Binary data inversion disable */
#define SMARTCARD_ADVFEATURE_DATAINV_ENABLE   USART_CR1_DATAINV          /*!< Binary data inversion enable  */
/**
  * @}
  */

/** @defgroup SMARTCARD_Rx_Tx_Swap SMARTCARD advanced feature RX TX pins swap
  * @{
  */
#define SMARTCARD_ADVFEATURE_SWAP_DISABLE   0x00000000U                  /*!< TX/RX pins swap disable */
#define SMARTCARD_ADVFEATURE_SWAP_ENABLE    USART_CR1_SWAP               /*!< TX/RX pins swap enable  */
/**
  * @}
  */

/** @defgroup SMARTCARD_MSB_First   SMARTCARD advanced feature MSB first
  * @{
  */
#define SMARTCARD_ADVFEATURE_MSBFIRST_DISABLE      0x00000000U           /*!< Most significant bit sent/received first disable */
#define SMARTCARD_ADVFEATURE_MSBFIRST_ENABLE       USART_CR1_MSB         /*!< Most significant bit sent/received first enable  */
/**
  * @}
  */

